improved readme.md files
